#### Degree Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol Â°, indicating unit Degrees.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Degree { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Degree As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Degree { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace